arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_ftm_hal.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define CHAN0_IDX (0U) /*!< Channel number for CHAN0.*/
#define CHAN1_IDX (1U) /*!< Channel number for CHAN1.*/
#define CHAN2_IDX (2U) /*!< Channel number for CHAN2.*/
#define CHAN3_IDX (3U) /*!< Channel number for CHAN3.*/
#define CHAN4_IDX (4U) /*!< Channel number for CHAN4.*/
#define CHAN5_IDX (5U) /*!< Channel number for CHAN5.*/
#define CHAN6_IDX (6U) /*!< Channel number for CHAN6.*/
#define CHAN7_IDX (7U) /*!< Channel number for CHAN7.*/



/*! @brief FlexTimer clock source selection*/
typedef enum
{
    FTM_CLOCK_SOURCE_NONE           = 0x00U,    /*!< None */
    FTM_CLOCK_SOURCE_SYSTEMCLK      = 0x01U,    /*!< System clock */
    FTM_CLOCK_SOURCE_FIXEDCLK       = 0x02U,    /*!< Fixed clock */
    FTM_CLOCK_SOURCE_EXTERNALCLK    = 0x03U     /*!< External clock */
}ftm_clock_source_t;

/*! @brief FlexTimer pre-scaler factor selection for the clock source. In quadrature
    decoder mode set FTM_CLOCK_DIVID_BY_1.*/
typedef enum
{
    FTM_CLOCK_DIVID_BY_1    = 0x00U,    /*!< Divide by 1 */
    FTM_CLOCK_DIVID_BY_2    = 0x01U,    /*!< Divide by 2 */
    FTM_CLOCK_DIVID_BY_4    = 0x02U,    /*!< Divide by 4 */
    FTM_CLOCK_DIVID_BY_8    = 0x03U,    /*!< Divide by 8 */
    FTM_CLOCK_DIVID_BY_16   = 0x04U,    /*!< Divide by 16 */
    FTM_CLOCK_DIVID_BY_32   = 0x05U,    /*!< Divide by 32 */
    FTM_CLOCK_DIVID_BY_64   = 0x06U,    /*!< Divide by 64 */
    FTM_CLOCK_DIVID_BY_128  = 0x07U     /*!< Divide by 128 */
}ftm_clock_ps_t;

/*! @brief FlexTimer pre-scaler factor for the deadtime insertion*/
typedef enum
{
    FTM_DEADTIME_DIVID_BY_1 = 0x01U, /*!< Divide by 1 */
    FTM_DEADTIME_DIVID_BY_4 = 0x02U, /*!< Divide by 4 */
    FTM_DEADTIME_DIVID_BY_16= 0x03U, /*!< Divide by 16 */
}ftm_deadtime_ps_t;

/*! @brief FlexTimer output compare edge mode. Toggle, clear or set.*/
typedef enum
{
    FTM_DISABLE_OUTPUT  = 0x00U,    /*! No action on output pin */
    FTM_TOGGLE_ON_MATCH = 0x01U,    /*! Toggle on match */
    FTM_CLEAR_ON_MATCH  = 0x02U,    /*! Clear on match */
    FTM_SET_ON_MATCH    = 0x03U     /*! Set on match */
}ftm_output_compare_mode_t;

/*! @brief FlexTimer PWM output pulse mode, high-true or low-true on match up */
typedef enum
{
    FTM_POLARITY_LOW  = 0x00U,  /*!< When counter > CnV output signal is LOW */
    FTM_POLARITY_HIGH = 0x01U   /*!< When counter > CnV output signal is HIGH */
}ftm_polarity_t;

/*! @brief FlexTimer PWM channel (n+1) polarity for combine mode */
typedef enum
{
    FTM_MAIN_INVERTED   = 0x01U,  /*!< The channel (n+1) output is the inverse of the
                                    channel (n) output  */
    FTM_MAIN_DUPLICATED = 0x00U   /*!< The channel (n+1) output is the same as the
                                    channel (n) output */
}ftm_second_channel_polarity_t;

/*! @brief FlexTimer quadrature decode modes, phase encode or count and direction mode */
typedef enum
{
    FTM_QUAD_PHASE_ENCODE   = 0x00U,    /*!< Phase encode mode */
    FTM_QUAD_COUNT_AND_DIR  = 0x01U     /*!< Counter and direction moe */
}ftm_quad_decode_mode_t;

/*! @brief FlexTimer quadrature phase polarities, normal or inverted polarity */
typedef enum
{
    FTM_QUAD_PHASE_NORMAL = 0x00U,  /*!< Phase input signal is not inverted before identifying
                                    the rising and falling edges of this signal. */
    FTM_QUAD_PHASE_INVERT = 0x01U   /*!< Phase input signal is inverted before identifying
                                    the rising and falling edges of this signal.*/
}ftm_quad_phase_polarity_t;


/*! @brief Options for the FlexTimer behaviour in BDM Mode */
typedef enum
{
    FTM_BDM_MODE_00 = 0x00U,    /*!< FTM counter stopped, CH(n)F bit can be set, FTM channels
                                in functional mode, writes to MOD,CNTIN and C(n)V registers bypass
                                the register buffers.*/
    FTM_BDM_MODE_01 = 0x01U,    /*!< FTM counter stopped, CH(n)F bit is not set, FTM channels
                                outputs are forced to their safe value , writes to MOD,CNTIN and
                                C(n)V registers bypass the register buffers. */
    FTM_BDM_MODE_10 = 0x02U,    /*!< FTM counter stopped, CH(n)F bit is not set, FTM channels
                                outputs are frozen when chip enters in BDM mode, writes to MOD,
                                CNTIN and C(n)V registers bypass the register buffers.*/
    FTM_BDM_MODE_11 = 0x03U     /*!< FTM counter in functional mode, CH(n)F bit can be set,
                                FTM channels in functional mode, writes to MOD,CNTIN and C(n)V
                                registers is in fully functional mode. */
}ftm_bdm_mode_t;

/*! @brief FlexTimer fault control  */
typedef enum
{
    FTM_FAULT_CONTROL_DISABLED  = 0x00U,    /*!< Fault control is disabled for all channels. */
    FTM_FAULT_CONTROL_MAN_EVEN  = 0x01U,    /*!< Fault control is enabled for even channels
                                            only (channels 0, 2, 4, and 6), and the selected
                                            mode is the manual fault clearing. */
    FTM_FAULT_CONTROL_MAN_ALL   = 0x02U,    /*!< Fault control is enabled for all channels,
                                            and the selected mode is the manual fault clearing. */
    FTM_FAULT_CONTROL_AUTO_ALL  = 0x03U     /*!< Fault control is enabled for all channels, and
                                            the selected mode is the automatic fault clearing. */
}ftm_fault_mode_t;

/*! @brief FTM sync source */
typedef enum
{
    FTM_SYSTEM_CLOCK    = 0U,       /*!< Register is updated with its buffer value at all rising
                                    edges of system clock.*/
    FTM_PWM_SYNC        = 1U,       /*!< Register is updated with its buffer value at the
                                    FTM synchronization.*/
} ftm_reg_update_t;

