arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_ftm_hal.h
/*! @brief FTM sync mode  */
typedef enum
{
    FTM_WAIT_LOADING_POINTS = 0U,   /*!< FTM register is updated at first loading point.*/
    FTM_UPDATE_NOW          = 1U,   /*!< FTM register is updated immediately.*/
} ftm_pwm_sync_mode_t;



/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*FTM Half Cycle Register*/
/*!
 * @brief Sets the value for the half cycle reload register
 *
 * @param ftmBase The FTM base address pointer
 * @param value  16 bit counter value
 */
static inline void FTM_HAL_SetHalfCycleValue(FTM_Type* const ftmBase, uint16_t value)
{
    ((ftmBase)->HCR) = value;
}


/*FTM timer control*/
/*!
 * @brief Sets the FTM clock source.
 *
 * @param ftmBase The FTM base address pointer
 * @param clock  The FTM peripheral clock selection\n
 *        bits - 00: No clock  01: system clock  10: fixed clock   11: External clock
 */
static inline void FTM_HAL_SetClockSource(FTM_Type* const ftmBase, ftm_clock_source_t clock)
{
    FTM_RMW_SC(ftmBase, FTM_SC_CLKS_MASK, FTM_SC_CLKS(clock));
}

/*!
 * @brief Reads the FTM clock source.
 *
 * @param ftmBase The FTM base address pointer
 *
 * @return  The FTM clock source selection\n
 *          bits - 00: No clock  01: system clock  10: fixed clock   11:External clock
 */
static inline uint8_t FTM_HAL_GetClockSource(FTM_Type* const ftmBase)
{
    return ((((ftmBase)->SC) & FTM_SC_CLKS_MASK) >> FTM_SC_CLKS_SHIFT);
}

/*!
 * @brief Sets the FTM clock divider.
 *
 * @param ftmBase The FTM base address pointer
 * @param ps  The FTM peripheral clock pre-scale divider
 */
static inline void FTM_HAL_SetClockPs(FTM_Type* const ftmBase, ftm_clock_ps_t ps)
{
    FTM_RMW_SC(ftmBase, FTM_SC_PS_MASK, FTM_SC_PS(ps));
}

/*!
 * @brief Reads the FTM clock divider.
 *
 * @param ftmBase The FTM base address pointer
 *
 * @return The FTM clock pre-scale divider
 */
static inline uint8_t FTM_HAL_GetClockPs(FTM_Type* const ftmBase)
{
    return  ((((ftmBase)->SC) & FTM_SC_PS_MASK) >> FTM_SC_PS_SHIFT);
}

/*!
 * @brief Enables the FTM peripheral timer overflow interrupt.
 *
 * @param ftmBase The FTM base address pointer
 * @param state true - overflow interrupt enabled false - overflow interrupt disabled
 */
static inline void FTM_HAL_SetTimerOverflowInt(FTM_Type* const ftmBase, bool state)
{
    FTM_RMW_SC(ftmBase, FTM_SC_TOIE_MASK, FTM_SC_TOIE(state));
}


/*!
 * @brief Reads the bit that controls enabling the FTM timer overflow interrupt.
 *
 * @param ftmBase The FTM base address pointer
 * @return true if overflow interrupt is enabled, false if not
 */
static inline bool FTM_HAL_IsOverflowIntEnabled(FTM_Type* const ftmBase)
{
    return (BITBAND_ACCESS32(&((ftmBase)->SC), FTM_SC_TOIE_SHIFT)) ? true : false;
}


/*!
 * @brief  Enable Pwm channel Outputs
 *
 * @param ftmBase The FTM base address pointer
 * @param channel The FTM channel
 */
static inline void FTM_HAL_EnablePwmChannelOutputs(FTM_Type* const ftmBase, uint8_t channel)
{
    FTM_RMW_SC(ftmBase, (1U << (channel + FTM_FEATURE_OUTPUT_CHANNEL_OFFSET)), (1U << (channel + FTM_FEATURE_OUTPUT_CHANNEL_OFFSET)));
}

/*!
 * @brief Disable Pwm channel Outputs
 *
 * @param ftmBase The FTM base address pointer
 * @param channel The FTM channel
 */
static inline void FTM_HAL_DisablePwmChannelOutputs(FTM_Type* const ftmBase, uint8_t channel)
{
    uint32_t regValue = ((ftmBase)->SC);
    regValue = regValue & (~(1U << (channel + FTM_FEATURE_OUTPUT_CHANNEL_OFFSET)));
    ((ftmBase)->SC) = (regValue);
}


/*!
 * @brief Clears the timer overflow interrupt flag.
 *
 * @param ftmBase The FTM base address pointer
 */
static inline void FTM_HAL_ClearTimerOverflow(FTM_Type* const ftmBase)
{
    /*BITBAND_ACCESS32(&((ftmBase)->SC), FTM_SC_TOF_SHIFT) = (0U);*/
    FTM_RMW_SC(ftmBase, FTM_SC_TOF_MASK, FTM_SC_TOF(0U));
}


/*!
 * @brief Returns the FTM peripheral timer overflow interrupt flag.
 *
 * @param ftmBase The FTM base address pointer
 * @return true if overflow, false if not
 */
static inline bool FTM_HAL_HasTimerOverflowed(FTM_Type* const ftmBase)
{
    return ((BITBAND_ACCESS32(&((ftmBase)->SC), FTM_SC_TOF_SHIFT)) ? true: false);
}

/*!
 * @brief Sets the FTM count direction bit.
 *
 * @param ftmBase The FTM base address pointer
 * @param mode 1:up counting mode 0:up down counting mode
 */
static inline void FTM_HAL_SetCpwms(FTM_Type* const ftmBase, uint8_t mode)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(mode < 2U);
#endif

    /*BITBAND_ACCESS32(&((ftmBase)->SC), FTM_SC_CPWMS_SHIFT) = (mode); */
    FTM_RMW_SC(ftmBase, FTM_SC_CPWMS_MASK, FTM_SC_CPWMS(mode));
}

/*!
 * @brief Gets the FTM count direction bit.
 *
 * @param ftmBase The FTM base address pointer
 * @return mode 1:up counting mode 0:up down counting mode
 */
static inline uint8_t FTM_HAL_GetCpwms(FTM_Type* const ftmBase)
{
    return ((((ftmBase)->SC) & FTM_SC_CPWMS_MASK) >> FTM_SC_CPWMS_SHIFT);
}

/*!
 * @brief Sets the FTM peripheral current counter value.
 *
 * @param ftmBase The FTM base address pointer
 * @param val  FTM timer counter value to be set
 */
static inline void  FTM_HAL_SetCounter(FTM_Type* const ftmBase, uint16_t value)
{
    FTM_RMW_CNT(ftmBase, FTM_CNT_COUNT_MASK, FTM_CNT_COUNT(value));
}

/*!
 * @brief Returns the FTM peripheral current counter value.
 *
 * @param ftmBase The FTM base address pointer
 * @return current FTM timer counter value
 */
static inline uint16_t  FTM_HAL_GetCounter(FTM_Type* const ftmBase)
{
    return ((((ftmBase)->CNT) & FTM_CNT_COUNT_MASK) >> FTM_CNT_COUNT_SHIFT);
}

/*!
 * @brief Sets the FTM peripheral timer modulo value.
 *
 * @param ftmBase The FTM base address pointer
 * @param val The value to be set to the timer modulo
 */
static inline void FTM_HAL_SetMod(FTM_Type* const ftmBase, uint16_t value)
{
    FTM_RMW_MOD(ftmBase, FTM_MOD_MOD_MASK, FTM_MOD_MOD(value));
}

/*!
 * @brief Returns the FTM peripheral counter modulo value.
 *
 * @param ftmBase The FTM base address pointer
 * @return FTM timer modulo value
 */
static inline uint16_t  FTM_HAL_GetMod(FTM_Type* const ftmBase)
{
    return ((((ftmBase)->MOD) & FTM_MOD_MOD_MASK) >> FTM_MOD_MOD_SHIFT);
}

/*!
 * @brief Sets the FTM peripheral timer counter initial value.
 *
 * @param ftmBase The FTM base address pointer
 * @param val initial value to be set
 */
static inline void FTM_HAL_SetCounterInitVal(FTM_Type* const ftmBase, uint16_t value)
{
    FTM_RMW_CNTIN(ftmBase, FTM_CNTIN_INIT_MASK, FTM_CNTIN_INIT(value));
}

/*!
 * @brief Returns the FTM peripheral counter initial value.
 *
 * @param ftmBase The FTM base address pointer
 * @return FTM timer counter initial value
 */
static inline uint16_t  FTM_HAL_GetCounterInitVal(FTM_Type* const ftmBase)
{
    return ((((ftmBase)->CNTIN) & FTM_CNTIN_INIT_MASK) >> FTM_CNTIN_INIT_SHIFT);
}

/*!
 * @brief Sets the FTM peripheral timer channel mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param selection The mode to be set valid value MSnB:MSnA :00,01, 10, 11
 */
static inline void FTM_HAL_SetChnMSnBAMode(FTM_Type* const ftmBase, uint8_t channel,
                                            uint8_t selection)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif

    //write MSA bit*/
    FTM_RMW_CnSCV_REG(ftmBase,channel, FTM_CnSC_MSA_MASK, FTM_CnSC_MSA(selection & 1U) );

    //write MSB bit*/
    FTM_RMW_CnSCV_REG(ftmBase,channel, FTM_CnSC_MSB_MASK, FTM_CnSC_MSB(selection & 2U ? 1U : 0U) );
}

/*!
 * @brief Sets the FTM peripheral timer channel edge level.
 *
 * @param ftmBase   The FTM base address pointer
 * @param channel   The FTM peripheral channel number
 * @param config    ELSnB:ELSnA :00,01, 10, 11
 */
static inline void FTM_HAL_SetChnEdgeLevel(FTM_Type* const ftmBase, uint8_t channel, uint8_t level)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif

    //write MSA bit*/
    FTM_RMW_CnSCV_REG(ftmBase,channel, FTM_CnSC_ELSA_MASK, FTM_CnSC_ELSA(level & 1U ? 1U : 0U) );

    //write MSB bit*/
    FTM_RMW_CnSCV_REG(ftmBase,channel, FTM_CnSC_ELSB_MASK, FTM_CnSC_ELSB(level & 2U ? 1U : 0U) );
}


/*!
 * @brief Clears the content of Channel (n) Status And Control.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 */
static inline void FTM_HAL_ClearChSC(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif

    ((ftmBase)->CONTROLS[channel].CnSC) = 0U;
}


/*!
 * @brief Gets the FTM peripheral timer channel mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @return The MSnB:MSnA mode value, will be 00,01, 10, 11
 */
static inline uint8_t FTM_HAL_GetChnMode(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    uint8_t retValue;

    retValue = ((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_MSA_MASK) >> FTM_CnSC_MSA_SHIFT);

    retValue |= (((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_MSB_MASK) >>
                FTM_CnSC_MSB_SHIFT) << 1U);

