arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_ftm_hal.h
    return  retValue;
}

/*!
 * @brief Gets the FTM peripheral timer channel edge level.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @return The ELSnB:ELSnA mode value, will be 00,01, 10, 11
 */
static inline uint8_t FTM_HAL_GetChnEdgeLevel(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    uint8_t retValue;

    retValue = ((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_ELSA_MASK) >> FTM_CnSC_ELSA_SHIFT);

    retValue |= (((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_ELSB_MASK) >>
                FTM_CnSC_ELSB_SHIFT) << 1U);

    return  retValue;
}

/*!
 * @brief Enables or disables the FTM peripheral timer channel DMA.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param val enable or disable
 */
static inline void FTM_HAL_SetChnDmaCmd(FTM_Type* const ftmBase, uint8_t channel, bool val)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif

    //write DMA bit*/
    FTM_RMW_CnSCV_REG(ftmBase,channel, FTM_CnSC_DMA_MASK, FTM_CnSC_DMA(val? 1U : 0U));
}

/*!
 * @brief Returns whether the FTM peripheral timer channel DMA is enabled.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @return true if enabled, false if disabled
 */
static inline bool FTM_HAL_IsChnDma(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    return ((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_DMA_MASK) ? true : false);
}

/*!
 * @brief Get FTM channel(n) interrupt enabled or not.
 * @param ftmBase FTM module base address.
 * @param channel  The FTM peripheral channel number
 */
static inline bool FTM_HAL_IsChnIntEnabled(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    return ((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_CHIE_MASK) ? true : false);
}

/*!
 * @brief Enables the FTM peripheral timer channel(n) interrupt.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 */
static inline void FTM_HAL_EnableChnInt(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    FTM_RMW_CnSCV_REG(ftmBase, channel, FTM_CnSC_CHIE_MASK, FTM_CnSC_CHIE(1U));
}
/*!
 * @brief Disables the FTM peripheral timer channel(n) interrupt.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 */
static inline void FTM_HAL_DisableChnInt(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    FTM_RMW_CnSCV_REG(ftmBase, channel, FTM_CnSC_CHIE_MASK, FTM_CnSC_CHIE(0U));
}

/*!
 * @brief Returns whether any event for the FTM peripheral timer channel has occurred.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @return true if event occurred, false otherwise.
 */
static inline bool FTM_HAL_HasChnEventOccurred(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    return ((((ftmBase)->CONTROLS[channel].CnSC) & FTM_CnSC_CHF_MASK) ? true : false);
}

/*!
 * @brief Clear the channel flag by writing a 0 to the CHF bit.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 */
static inline void FTM_HAL_ClearChnEventFlag(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    FTM_RMW_CnSCV_REG(ftmBase, channel, FTM_CnSC_CHF_MASK, FTM_CnSC_CHF(0U));
}

/*FTM channel control*/
/*!
 * @brief Sets the FTM peripheral timer channel counter value.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param val counter value to be set
 */
static inline void FTM_HAL_SetChnCountVal(FTM_Type* const ftmBase, uint8_t channel, uint16_t val)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    ((ftmBase)->CONTROLS[channel].CnV) = val;
}

/*!
 * @brief Gets the FTM peripheral timer channel counter value.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @return return channel counter value
 */
static inline uint16_t FTM_HAL_GetChnCountVal(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    return (uint16_t)((ftmBase)->CONTROLS[channel].CnV);
}

/*!
 * @brief Gets the FTM peripheral timer  channel event status.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @return return channel event status value
 */
static inline uint32_t FTM_HAL_GetChnEventStatus(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    return (((ftmBase)->STATUS) & (1U << channel));
    /*return BR_FTM_STATUS(ftmBase, channel);*/
}

/*!
 * @brief Gets the FTM peripheral timer status info for all channels.
 *
 * @param ftmBase The FTM base address pointer
 * @return return channel event status value
 */
static inline uint32_t FTM_HAL_GetEventStatus(FTM_Type* const ftmBase)
{
    return (((ftmBase)->STATUS) & (0xFFU));
}

/*!
 * @brief Clears the FTM peripheral timer all channel event status.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 */
static inline void FTM_HAL_ClearChnEventStatus(FTM_Type* const ftmBase, uint8_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    ((ftmBase)->STATUS) |= (1U << channel);
}

/*!
 * @brief Writes the provided value to the OUTMASK register.
 *
 * This function will mask/unmask multiple channels.
 *
 * @param ftmBase The FTM base address pointer
 * @param regVal  value to be written to the register
 */
static inline void FTM_HAL_SetOutmaskReg(FTM_Type* const ftmBase, uint32_t regVal)
{
    ((ftmBase)->OUTMASK) = regVal;
}

/*!
 * @brief Sets the FTM peripheral timer channel output mask.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param mask mask to be set 0 or 1, unmasked or masked
 */
static inline void FTM_HAL_SetChnOutputMask(FTM_Type* const ftmBase, uint8_t channel, bool  mask)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if(true == mask)
    {
        ((ftmBase)->OUTMASK)  |=    (1U << channel);
    }
    else
    {
        ((ftmBase)->OUTMASK)  &=    ~(1U << channel);
    }
}

/*!
 * @brief Sets the FTM peripheral timer channel output initial state 0 or 1.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param state counter value to be set 0 or 1
 */
static inline void FTM_HAL_SetChnOutputInitStateCmd(FTM_Type* const ftmBase, uint8_t channel,
                                                    bool state)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if(true == state)
    {
        ((ftmBase)->OUTINIT) |= (1U << channel);
    }
    else
    {
        ((ftmBase)->OUTINIT) &= ~(1U << channel);
    }
}

/*!
 * @brief Sets the FTM peripheral timer channel output polarity.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param pol polarity to be set 0 or 1
 */
static inline void FTM_HAL_SetChnOutputPolarityCmd(FTM_Type* const ftmBase, uint8_t channel,
                                                    ftm_polarity_t pol)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if (FTM_POLARITY_HIGH == pol)
    {
        ((ftmBase)->POL) &= ~(1U << channel);
    }
    else
    {
        ((ftmBase)->POL) |= (1U << channel);
    }
}

/*!
 * @brief Sets the FTM peripheral timer channel fault input polarity.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number
 * @param pol polarity  to be set, 0: active high, 1:active low
 */
static inline void FTM_HAL_SetChnFaultInputPolarityCmd(FTM_Type* const ftmBase, uint8_t fltChannel,
                                                        bool pol)
{
    if (FTM_POLARITY_HIGH == pol)
    {
        ((ftmBase)->FLTPOL) &= ~(1U << fltChannel);
    }
    else
    {
        ((ftmBase)->FLTPOL) |= (1U << fltChannel);
    }
}

/*!
 * @brief Enables/disables the FTM peripheral timer fault interrupt.
 *
 * @param ftmBase The FTM base address pointer
 * @param state Timer fault interrupt state (true - enabled, false - disabled)
 */

static inline void FTM_HAL_SetFaultInt(FTM_Type* const ftmBase, bool state)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_FAULTIE_MASK, FTM_MODE_FAULTIE(state));
}

/*!
 * @brief Disables the FTM peripheral timer fault interrupt.
 *
 * @param ftmBase The FTM base address pointer
 */
static inline void FTM_HAL_DisableFaultInt(FTM_Type* const ftmBase)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_FAULTIE_MASK, FTM_MODE_FAULTIE(0U));
}

/*!
 * @brief Return true/false whether the Fault interrupt was enabled or not
 *
 * @param ftmBase The FTM base address pointer
 */
static inline bool FTM_HAL_IsFaultIntEnabled(FTM_Type* const ftmBase)
{
    return (BITBAND_ACCESS32(&((ftmBase)->MODE), FTM_MODE_FAULTIE_SHIFT)) ? true : false;
}

/*!
 * @brief Clears all fault interrupt flags that are active.
 *
 * @param ftmBase The FTM base address pointer
 */
static inline void FTM_HAL_ClearFaultsIsr(FTM_Type* const ftmBase)
{
    FTM_RMW_FMS(ftmBase, FTM_FMS_FAULTF0_MASK | FTM_FMS_FAULTF_MASK, FTM_FMS_FAULTF0(0U)
                | FTM_FMS_FAULTF(0U));
    FTM_RMW_FMS(ftmBase, FTM_FMS_FAULTF1_MASK | FTM_FMS_FAULTF_MASK, FTM_FMS_FAULTF1(0U)
                | FTM_FMS_FAULTF(0U));
    FTM_RMW_FMS(ftmBase, FTM_FMS_FAULTF2_MASK | FTM_FMS_FAULTF_MASK, FTM_FMS_FAULTF2(0U)
                | FTM_FMS_FAULTF(0U));
    FTM_RMW_FMS(ftmBase, FTM_FMS_FAULTF3_MASK | FTM_FMS_FAULTF_MASK, FTM_FMS_FAULTF3(0U)
                | FTM_FMS_FAULTF(0U));
}

/*!
 * @brief Defines the FTM fault control mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param mode, 0: Fault control disabled
                1: Fault control enabled for even channel (0, 2, 4, 6) and manual fault clearing.
                2: Fault control enabled for all channels and manual fault clearing is enabled.
                3: Fault control enabled for all channels and automatic fault clearing is enabled.
 */
static inline void FTM_HAL_SetFaultControlMode(FTM_Type* const ftmBase, ftm_fault_mode_t mode)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_FAULTM_MASK, FTM_MODE_FAULTM((uint8_t)mode));
}

/*!
 * @brief Enables or disables the FTM peripheral timer capture test mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable capture test mode, false to disable
 */
static inline void FTM_HAL_SetCaptureTestCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_CAPTEST_MASK, FTM_MODE_CAPTEST(enable ? 1U : 0U));
}

/*!
 * @brief Enables or disables the FTM write protection.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true: Write-protection is enabled, false: Write-protection is disabled
 */
static inline void FTM_HAL_SetWriteProtectionCmd(FTM_Type* const ftmBase, bool enable)
{
    if (true == enable)
    {
        BITBAND_ACCESS32(&((ftmBase)->FMS), FTM_FMS_WPEN_SHIFT) = (1U);
    }
    else
    {
        BITBAND_ACCESS32(&((ftmBase)->MODE), FTM_MODE_WPDIS_SHIFT) = (1U);
    }
}

/*!
 * @brief Enables the FTM peripheral timer group.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true: all registers including FTM-specific registers are available
 *                false: only the TPM-compatible registers are available
 */
static inline void FTM_HAL_Enable(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_FTMEN_MASK, FTM_MODE_FTMEN(enable ? 1U : 0U));
}

/*!
 * @brief Initializes the channels output.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true: the channels output is initialized according to the state of OUTINIT reg
 *                false: has no effect
 */
static inline void FTM_HAL_SetInitChnOutputCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_INIT_MASK, FTM_MODE_INIT(enable ? 1U : 0U));
}

/*!
 * @brief Sets the FTM peripheral timer sync mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true: no restriction both software and hardware triggers can be used\n
 *                false: software trigger can only be used for MOD and CnV synch, hardware trigger
 *                       only for OUTMASK and FTM counter synch.
 */
static inline void FTM_HAL_SetPwmSyncMode(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_MODE(ftmBase, FTM_MODE_PWMSYNC_MASK, FTM_MODE_PWMSYNC(enable ? 1U : 0U));
}


