arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_ftm_hal.h
/*FTM synchronization control*/
/*!
 * @brief Enables or disables the FTM peripheral timer software trigger.
 *
 * @param ftmBase The FTM base address pointer.
 * @param enable  true: software trigger is selected, false: software trigger is not selected
 */
static inline void FTM_HAL_SetSoftwareTriggerCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_SYNC(ftmBase, FTM_SYNC_SWSYNC_MASK, FTM_SYNC_SWSYNC(enable ? 1U : 0U));
}

/*!
 * @brief Sets the FTM peripheral timer hardware trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param trigger_num  0, 1, 2 for trigger0, trigger1 and trigger3
 * @param enable true: enable hardware trigger from field trigger_num for PWM synch
 *               false: disable hardware trigger from field trigger_num for PWM synch
 */
void FTM_HAL_SetHardwareSyncTriggerSrc(FTM_Type* const ftmBase, uint32_t trigger_num, bool enable);

/*!
 * @brief Determines when the OUTMASK register is updated with the value of its buffer.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true if OUTMASK register is updated only by PWM sync\n
 *                false if OUTMASK register is updated in all rising edges of the system clock
 */
static inline void FTM_HAL_SetOutmaskPwmSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_SYNC(ftmBase, FTM_SYNC_SYNCHOM_MASK, FTM_SYNC_SYNCHOM(enable ? 1U : 0U));
}

/*!
 * @brief Determines if the FTM counter is re-initialized when the selected trigger for
 * synchronization is detected.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to update FTM counter when triggered , false to count normally
 */
static inline void FTM_HAL_SetCountReinitSyncCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_SYNC(ftmBase, FTM_SYNC_REINIT_MASK, FTM_SYNC_REINIT(enable ? 1U : 0U));
}

/*!
 * @brief Enables or disables the FTM peripheral timer maximum loading points.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable maximum loading point, false to disable
 */
static inline void FTM_HAL_SetMaxLoadingCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_SYNC(ftmBase, FTM_SYNC_CNTMAX_MASK, FTM_SYNC_CNTMAX(enable ? 1U : 0U));
}
/*!
 * @brief Enables or disables the FTM peripheral timer minimum loading points.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable minimum loading point, false to disable
 */
static inline void FTM_HAL_SetMinLoadingCmd(FTM_Type* const ftmBase, bool enable)
{
    FTM_RMW_SYNC(ftmBase, FTM_SYNC_CNTMIN_MASK, FTM_SYNC_CNTMIN(enable ? 1U : 0U));
}



/*!
 * @brief Enables the FTM peripheral timer channel pair fault control.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable fault control, false to disable
 */
static inline  void FTM_HAL_SetDualChnFaultCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum,
                                               bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if (true == enable)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_FAULTEN0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_FAULTEN0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}

/*!
 * @brief Enables or disables the FTM peripheral timer channel pair counter PWM sync.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable PWM synchronization, false to disable
 */
static inline void FTM_HAL_SetDualChnPwmSyncCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum,
                                                bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if (true == enable)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_SYNCEN0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_SYNCEN0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}

/*!
 * @brief Enables or disabled the FTM peripheral timer channel pair deadtime insertion.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable deadtime insertion, false to disable
 */
static inline void FTM_HAL_SetDualChnDeadtimeCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if (true == enable)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_DTEN0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_DTEN0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}

/*!
 * @brief Enables or disables the FTM peripheral timer channel dual edge capture.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable dual edge capture mode, false to disable
 */
static inline void FTM_HAL_SetDualChnDecapCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if (true == enable)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_DECAP0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_DECAP0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}

/*!
 * @brief Enables the FTM peripheral timer dual edge capture mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable dual edge capture, false to disable
 */
static inline void FTM_HAL_SetDualEdgeCaptureCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum,
                                                 bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if (true == enable)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_DECAPEN0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_DECAPEN0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}

/*!
 * @brief Enables the FTM peripheral timer dual edge capture mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable dual edge capture, false to disable
 */
static inline bool FTM_HAL_GetDualEdgeCaptureBit(FTM_Type* const ftmBase, uint8_t chnlPairNum)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    return (((ftmBase)->COMBINE) & (FTM_COMBINE_DECAPEN0_MASK <<
           (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH))  ? true : false);
}


/*!
 * @brief Enables or disables the FTM peripheral timer channel pair output complement mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable complementary mode, false to disable
 */
static inline void FTM_HAL_SetDualChnCompCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum,
                                            ftm_second_channel_polarity_t polarity)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if (polarity == FTM_MAIN_INVERTED)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_COMP0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_COMP0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}

/*!
 * @brief Enables or disables the FTM peripheral timer channel pair output combine mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable channel pair to combine, false to disable
 */
static inline void FTM_HAL_SetDualChnCombineCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum,
                                                bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if (true == enable)
    {
        ((ftmBase)->COMBINE) |= (FTM_COMBINE_COMBINE0_MASK <<
                                (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
    else
    {
        ((ftmBase)->COMBINE) &= ~(FTM_COMBINE_COMBINE0_MASK <<
                                 (chnlPairNum * FTM_FEATURE_COMBINE_CHAN_CTRL_WIDTH));
    }
}



