arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_ftm_hal.h
/*FTM dead time insertion control*/
/*!
 * @brief Sets the FTM dead time divider.
 *
 * @param ftmBase The FTM base address pointer
 * @param divider  The FTM peripheral prescaler divider\n
 *                 0x :divided by 1, 10: divided by 4, 11:divided by 16
 */
static inline void FTM_HAL_SetDeadtimePrescale(FTM_Type* const ftmBase, ftm_deadtime_ps_t divider)
{
    FTM_RMW_DEADTIME(ftmBase, FTM_DEADTIME_DTPS_MASK, FTM_DEADTIME_DTPS((uint8_t)divider));
}

/*!
 * @brief Sets the FTM deadtime value.
 *
 * @param ftmBase The FTM base address pointer
 * @param count  The FTM peripheral  prescale divider\n
 *               0: no counts inserted, 1: 1 count is inserted, 2: 2 count is inserted....
 */
static inline void FTM_HAL_SetDeadtimeCount(FTM_Type* const ftmBase, uint8_t count)
{
    FTM_RMW_DEADTIME(ftmBase, FTM_DEADTIME_DTVAL_MASK, FTM_DEADTIME_DTVAL(count));
}

/*!
 * @brief Enables or disables the generation of the trigger when the FTM counter is equal
 *to the CNTIN register.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable, false to disable
 */
static inline void FTM_HAL_SetInitTriggerCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->EXTTRIG), FTM_EXTTRIG_INITTRIGEN_SHIFT) = (enable ? 1U : 0U);
}

/*FTM external trigger */
/*!
 * @brief Enables or disables the generation of the FTM peripheral timer channel trigger.
 *
 * Enables or disables the generation of the FTM peripheral timer channel trigger when the
 * FTM counter is equal to its initial value. Channels 6 and 7 cannot be used as triggers.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel Channel to be enabled,  valid value 0, 1, 2, 3, 4, 5
 * @param val  true to enable, false to disable
 */
void FTM_HAL_SetChnTriggerCmd(FTM_Type* const ftmBase, uint8_t channel, bool val);

/*!
 * @brief Checks whether any channel trigger event has occurred.
 *
 * @param ftmBase The FTM base address pointer
 * @return true if there is a channel trigger event, false if not.
 */
static inline bool FTM_HAL_IsChnTriggerGenerated(FTM_Type* const ftmBase)
{
    return ((BITBAND_ACCESS32(&((ftmBase)->EXTTRIG), FTM_EXTTRIG_TRIGF_SHIFT)) ? true : false);
}

/*Fault mode status*/
/*!
 * @brief Gets the FTM detected fault input.
 *
 * This function reads the status for all fault inputs
 *
 * @param ftmBase The FTM base address pointer
 * @return Return fault byte
 */
static inline uint8_t FTM_HAL_GetDetectedFaultInput(FTM_Type* const ftmBase)
{
    return (((ftmBase)->FMS) & 0x0f);
}

/*!
 * @brief Checks whether the write protection is enabled.
 *
 * @param ftmBase The FTM base address pointer
 * @return true if enabled, false if not
 */
static inline bool FTM_HAL_IsWriteProtectionEnabled(FTM_Type* const ftmBase)
{
    return BITBAND_ACCESS32(&((ftmBase)->FMS), FTM_FMS_WPEN_SHIFT) ? true : false;
}

/*Quadrature decoder control*/

/*!
 * @brief Enables the channel quadrature decoder.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable, false to disable
 */
static inline void FTM_HAL_SetQuadDecoderCmd(FTM_Type* const ftmBase, bool enable)
{
    /* BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_QUADEN_SHIFT) = (enable ? 1U : 0U);*/
    if (true == enable)
    {
        ((ftmBase)->QDCTRL) |= (1U << FTM_QDCTRL_QUADEN_SHIFT);
    }
    else
    {
        ((ftmBase)->QDCTRL) &= ~(1U << FTM_QDCTRL_QUADEN_SHIFT);
    }
}

/*!
 * @brief Enables or disables the phase A input filter.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable true enables the phase input filter, false disables the filter
 */
static inline void FTM_HAL_SetQuadPhaseAFilterCmd(FTM_Type* const ftmBase, bool enable)
{
    /* BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_PHAFLTREN_SHIFT) = (enable ? 1U : 0U);*/
    if (true == enable)
    {
        ((ftmBase)->QDCTRL) |= (1U << FTM_QDCTRL_PHAFLTREN_SHIFT);
    }
    else
    {
        ((ftmBase)->QDCTRL) &= ~(1U << FTM_QDCTRL_PHAFLTREN_SHIFT);
    }
}

/*!
 * @brief Enables or disables the phase B input filter.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable true enables the phase input filter, false disables the filter
 */
static inline void FTM_HAL_SetQuadPhaseBFilterCmd(FTM_Type* const ftmBase, bool enable)
{
    /* BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_PHBFLTREN_SHIFT) = (enable ? 1U : 0U);*/
    if (true == enable)
    {
        ((ftmBase)->QDCTRL) |= (1U << FTM_QDCTRL_PHBFLTREN_SHIFT);
    }
    else
    {
        ((ftmBase)->QDCTRL) &= ~(1U << FTM_QDCTRL_PHBFLTREN_SHIFT);
    }
}

/*!
 * @brief Selects polarity for the quadrature decode phase A input.
 *
 * @param ftmBase The FTM base address pointer
 * @param mode 0: Normal polarity, 1: Inverted polarity
 */
static inline void FTM_HAL_SetQuadPhaseAPolarity(FTM_Type* const ftmBase,
        ftm_quad_phase_polarity_t mode)
{
    /*BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_PHAPOL_SHIFT) = (uint8_t)(mode);*/
    FTM_RMW_QDCTRL(ftmBase, FTM_QDCTRL_PHAPOL_MASK, FTM_QDCTRL_PHAPOL((uint8_t)mode));

}

/*!
 * @brief Selects polarity for the quadrature decode phase B input.
 *
 * @param ftmBase The FTM base address pointer
 * @param mode 0: Normal polarity, 1: Inverted polarity
 */
static inline void FTM_HAL_SetQuadPhaseBPolarity(FTM_Type* const ftmBase,
        ftm_quad_phase_polarity_t mode)
{
    /*BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_PHBPOL_SHIFT) =(uint8_t)(mode);*/
    FTM_RMW_QDCTRL(ftmBase, FTM_QDCTRL_PHBPOL_MASK, FTM_QDCTRL_PHBPOL((uint8_t)mode));
}

/*!
 * @brief Sets the encoding mode used in quadrature decoding mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param quadMode 0: Phase A and Phase B encoding mode\n
 *                 1: Count and direction encoding mode
 */
static inline void FTM_HAL_SetQuadMode(FTM_Type* const ftmBase, ftm_quad_decode_mode_t quadMode)
{
    /*BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_QUADMODE_SHIFT) = (uint8_t)(quadMode);*/
    FTM_RMW_QDCTRL(ftmBase, FTM_QDCTRL_QUADMODE_MASK, FTM_QDCTRL_QUADMODE((uint8_t)quadMode));
}

/*!
 * @brief Gets the FTM counter direction in quadrature mode.
 *
 * @param ftmBase The FTM base address pointer
 *
 * @return 1 if counting direction is increasing, 0 if counting direction is decreasing
 */
static inline uint8_t FTM_HAL_GetQuadDir(FTM_Type* const ftmBase)
{
    return BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_QUADMODE_SHIFT);
}

/*!
 * @brief Gets the Timer overflow direction in quadrature mode.
 *
 * @param ftmBase The FTM base address pointer
 *
 * @return 1 if TOF bit was set on the top of counting,
 *         0 if TOF bit was set on the bottom of counting
 */
static inline uint8_t FTM_HAL_GetQuadTimerOverflowDir(FTM_Type* const ftmBase)
{
    return BITBAND_ACCESS32(&((ftmBase)->QDCTRL), FTM_QDCTRL_TOFDIR_SHIFT);
}


/*!
 * @brief Sets the fault input filter value.
 *
 * @param ftmBase The FTM base address pointer
 * @param value fault input filter value
 */
static inline void FTM_HAL_SetFaultInputFilterVal(FTM_Type* const ftmBase, uint32_t value)
{
    FTM_RMW_FLTCTRL(ftmBase, FTM_FLTCTRL_FFVAL_MASK, FTM_FLTCTRL_FFVAL(value));
}

/*!
 * @brief Enables or disables the fault input filter.
 *
 * @param ftmBase The FTM base address pointer
 * @param inputNum fault input to be configured, valid value 0, 1, 2, 3
 * @param enable  true to enable fault input filter, false to disable fault input filter
 */
static inline void FTM_HAL_SetFaultInputFilterCmd(FTM_Type* const ftmBase, uint8_t inputNum,
                                                 bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(inputNum < CHAN4_IDX);
#endif
    if(true == enable)
    {
        ((ftmBase)->FLTCTRL) |=  (1U << (inputNum + FTM_FLTCTRL_FFLTR0EN_SHIFT));
    }
    else
    {
        ((ftmBase)->FLTCTRL) &=  ~(1U << (inputNum + FTM_FLTCTRL_FFLTR0EN_SHIFT));
    }
}


/*!
 * @brief Clears the entire content value of the Fault control register.
 *
 * @param ftmBase The FTM base address pointer
 */
static inline void FTM_HAL_ClearFaultControl(FTM_Type* const ftmBase)
{
    ((ftmBase)->FLTCTRL) =  0U;
}

/*!
 * @brief Enables or disables the fault input.
 *
 * @param ftmBase The FTM base address pointer
 * @param inputNum fault input to be configured, valid value 0, 1, 2, 3
 * @param enable  true to enable fault input, false to disable fault input
 */
static inline void FTM_HAL_SetFaultInputCmd(FTM_Type* const ftmBase, uint8_t inputNum, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(inputNum < CHAN4_IDX);
#endif
    if(true == enable)
    {
        ((ftmBase)->FLTCTRL) |=  (1U << inputNum);
    }
    else
    {
        ((ftmBase)->FLTCTRL) &=  ~(1U << inputNum);
    }
}


/*!
 * @brief Configures the behaviour of the PWM outputs when a fault is detected
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true output pins are set tri-state,
                  false pins are set to a safe state determined by POL bits
 */
static inline void FTM_HAL_SetPwmFaultBehavior(FTM_Type* const ftmBase,bool enable)
{
    if(true == enable)
    {
        ((ftmBase)->FLTCTRL) |=  (1U << FTM_FLTCTRL_FSTATE_SHIFT);
    }
    else
    {
        ((ftmBase)->FLTCTRL) &=  ~(1U << FTM_FLTCTRL_FSTATE_SHIFT);
    }
}



/*!
 * @brief Enables or disables the channel invert for a channel pair.
 *
 * @param ftmBase The FTM base address pointer
 * @param chnlPairNum The FTM peripheral channel pair number
 * @param enable  true to enable channel inverting, false to disable channel inversion
 */
static inline void FTM_HAL_SetDualChnInvertCmd(FTM_Type* const ftmBase, uint8_t chnlPairNum,
                                                bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chnlPairNum < (FSL_FEATURE_FTM_CHANNEL_COUNT / 2));
#endif
    if(true == enable)
    {
        ((ftmBase)->INVCTRL) |=  (1U << chnlPairNum);
    }
    else
    {
        ((ftmBase)->INVCTRL) &=  ~(1U << chnlPairNum);
    }
}

/*!
 * @brief Writes the provided value to the Inverting control register.
 *
 * This function is enable/disable inverting control on multiple channel pairs.
 *
 * @param ftmBase The FTM base address pointer
 * @param regVal  value to be written to the register
 */
static inline void FTM_HAL_SetInvctrlReg(FTM_Type* const ftmBase, uint32_t regVal)
{
    ((ftmBase)->INVCTRL) = regVal;
}

/*FTM software output control*/
/*!
 * @brief Enables or disables the channel software output control.
 * @param ftmBase The FTM base address pointer
 * @param channel Channel to be enabled or disabled
 * @param enable  true to enable, channel output will be affected by software output control\n
                false to disable, channel output is unaffected
 */
static inline void FTM_HAL_SetChnSoftwareCtrlCmd(FTM_Type* const ftmBase, uint8_t channel,
                                                bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if(true == enable)
    {
        ((ftmBase)->SWOCTRL) |=  (1U << channel);
    }
    else
    {
        ((ftmBase)->SWOCTRL) &=  ~(1U << channel);
    }
}
/*!
 * @brief Sets the channel software output control value.
 *
 * @param ftmBase The FTM base address pointer.
 * @param channel Channel to be configured
 * @param enable  true to set 1, false to set 0
 */
static inline void FTM_HAL_SetChnSoftwareCtrlVal(FTM_Type* const ftmBase, uint8_t channel,
                                                bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if(true == enable)
    {
        ((ftmBase)->SWOCTRL) |=  (1U << (channel + FTM_SWOCTRL_CH0OCV_SHIFT));
    }
    else
    {
        ((ftmBase)->SWOCTRL) &=  ~(1U << (channel + FTM_SWOCTRL_CH0OCV_SHIFT));
    }
}

/*FTM PWM load control*/
/*!
 * @brief Enables or disables the loading of MOD, CNTIN and CV with values of their write buffer.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable, false to disable
 */
static inline void FTM_HAL_SetPwmLoadCmd(FTM_Type* const ftmBase, bool enable)
{
    /*BITBAND_ACCESS32(&((ftmBase)->PWMLOAD), FTM_PWMLOAD_LDOK_SHIFT) = ( enable ? 1U : 0U);*/
    if(true == enable)
    {
        ((ftmBase)->PWMLOAD) |=  (1U << FTM_PWMLOAD_LDOK_SHIFT );
    }
    else
    {
        ((ftmBase)->PWMLOAD) &=  ~(1U << FTM_PWMLOAD_LDOK_SHIFT);
    }
}

/*!
 * @brief Includes or excludes the channel in the matching process.
 *
 * @param ftmBase The FTM base address pointer
 * @param channel Channel to be configured
 * @param val   true means include the channel in the matching process\n
 *              false means do not include channel in the matching process
 */
static inline void FTM_HAL_SetPwmLoadChnSelCmd(FTM_Type* const ftmBase, uint8_t channel, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_FTM_CHANNEL_COUNT);
#endif
    if(true == enable)
    {
        ((ftmBase)->PWMLOAD) |=  (1U << channel );
    }
    else
    {
        ((ftmBase)->PWMLOAD) &=  ~(1U << channel);
    }
}

/*FTM configuration*/
/*!
 * @brief Enables or disables the FTM global time base signal generation to other FTM's.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable, false to disable
 */
static inline void FTM_HAL_SetGlobalTimeBaseOutputCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->CONF), FTM_CONF_GTBEOUT_SHIFT) = ( enable ? 1 : 0);
}

/*!
 * @brief Enables or disables the FTM timer global time base.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true to enable, false to disable
 */
static inline void FTM_HAL_SetGlobalTimeBaseCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->CONF), FTM_CONF_GTBEEN_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets the BDM mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param val FTM behaviour in BDM mode, options are defined in the enum ftm_bdm_mode_t
 */
static inline void FTM_HAL_SetBdmMode(FTM_Type* const ftmBase, ftm_bdm_mode_t val)
{
    FTM_RMW_CONF(ftmBase, FTM_CONF_BDMMODE_MASK, FTM_CONF_BDMMODE((uint8_t)val));
}

/*!
 * @brief Sets the FTM timer TOF Frequency
 *
 * @param ftmBase The FTM base address pointer
 * @param val  Value of the TOF bit set frequency
 */
static inline void FTM_HAL_SetLoadFreq(FTM_Type* const ftmBase, uint8_t val)
{
    FTM_RMW_CONF(ftmBase, FTM_CONF_LDFQ_MASK, FTM_CONF_LDFQ((uint8_t)val));
}



/*!
 * @brief Sets the sync mode for the FTM SWOCTRL register when using a hardware trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means the hardware trigger activates register sync\n
 *                false means the hardware trigger does not activate register sync.
 */
static inline void FTM_HAL_SetSwoctrlHardwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_HWSOC_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM INVCTRL register when using a hardware trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means the hardware trigger activates register sync\n
 *                false means the hardware trigger does not activate register sync.
 */
static inline void FTM_HAL_SetInvctrlHardwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_HWINVC_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM OUTMASK register when using a hardware trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means hardware trigger activates register sync\n
 *                false means hardware trigger does not activate register sync.
 */
static inline void FTM_HAL_SetOutmaskHardwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_HWOM_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM MOD, CNTIN and CV registers when using a hardware trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means hardware trigger activates register sync\n
 *                false means hardware trigger does not activate register sync.
 */
static inline void FTM_HAL_SetModCntinCvHardwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_HWWRBUF_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM counter register when using a hardware trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means hardware trigger activates register sync\n
 *                false means hardware trigger does not activate register sync.
 */
static inline void FTM_HAL_SetCounterHardwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_HWRSTCNT_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM SWOCTRL register when using a software trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means software trigger activates register sync\n
 *                false means software trigger does not activate register sync.
 */
static inline void FTM_HAL_SetSwoctrlSoftwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SWSOC_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM INVCTRL register when using a software trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means software trigger activates register sync\n
 *                false means software trigger does not activate register sync.
 */
static inline void FTM_HAL_SetInvctrlSoftwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SWINVC_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM OUTMASK register when using a software trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means software trigger activates register sync\n
 *                false means software trigger does not activate register sync.
 */
static inline void FTM_HAL_SetOutmaskSoftwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SWOM_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets synch mode for FTM MOD, CNTIN and CV registers when using a software trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means software trigger activates register sync\n
 *                false means software trigger does not activate register sync.
 */
static inline void FTM_HAL_SetModCntinCvSoftwareSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SWWRBUF_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets hardware trigger mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true FTM does not clear the TRIGx bit when the hardware trigger j is detected
 *                false FTM clears the TRIGx bit when the hardware trigger j is detected
 */
static inline void FTM_HAL_SetHwTriggerSyncModeCmd(FTM_Type* const ftmBase, bool enable)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_HWTRIGMODE_SHIFT) = (enable ? 1U : 0U);
}

/*!
 * @brief Sets sync mode for FTM counter register when using a software trigger.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means software trigger activates register sync
 *                false means software trigger does not activate register sync.
 */
static inline void FTM_HAL_SetCounterSoftwareSyncModeCmd(FTM_Type* const ftmBase, bool update_mode)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SWRSTCNT_SHIFT) = (update_mode ? 1U : 0U);
}

/*!
 * @brief Sets the PWM synchronization mode to enhanced or legacy.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means use Enhanced PWM synchronization\n
 *                false means to use Legacy mode
 */
static inline void FTM_HAL_SetPwmSyncModeCmd(FTM_Type* const ftmBase, bool mode)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SYNCMODE_SHIFT) = (mode ? 1U : 0U);
}

/*!
 * @brief Sets the SWOCTRL register PWM synchronization mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means SWOCTRL register is updated by PWM synch\n
 *                false means SWOCTRL register is updated at all rising edges of system clock
 */
static inline void FTM_HAL_SetSwoctrlPwmSyncModeCmd(FTM_Type* const ftmBase, ftm_reg_update_t mode)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_SWOC_SHIFT) = (mode ? 1U : 0U);
}

/*!
 * @brief Sets the INVCTRL register PWM synchronization mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means INVCTRL register is updated by PWM synch\n
 *                false means INVCTRL register is updated at all rising edges of system clock
 */
static inline void FTM_HAL_SetInvctrlPwmSyncModeCmd(FTM_Type* const ftmBase, ftm_reg_update_t mode)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_INVC_SHIFT) = (mode ? 1U : 0U);
}

/*!
 * @brief Sets the CNTIN register PWM synchronization mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param enable  true means CNTIN register is updated by PWM synch\n
 *                false means CNTIN register is updated at all rising edges of system clock
 */
static inline void FTM_HAL_SetCntinPwmSyncModeCmd(FTM_Type* const ftmBase, ftm_reg_update_t mode)
{
    BITBAND_ACCESS32(&((ftmBase)->SYNCONF), FTM_SYNCONF_CNTINC_SHIFT) = (mode ? 1U : 0U);
}


/*!
 * @brief Combines the channel control.
 *
 * Returns an index for each channel pair.
 *
 * @param channel  The FTM peripheral channel number.
 * @return 0 for channel pair 0 & 1
 *         1 for channel pair 2 & 3
 *         2 for channel pair 4 & 5
 *         3 for channel pair 6 & 7
 */
uint32_t FTM_HAL_GetChnPairIndex(uint8_t channel);


/*HAL functionality*/
/*!
 * @brief Resets the FTM registers
 *
 * @param ftmBase The FTM base address pointer
 */
void FTM_HAL_Reset(FTM_Type* const ftmBase);

/*!
 * @brief Initializes the FTM.
 *
 * @param ftmBase The FTM base address pointer.
 */
void FTM_HAL_Init(FTM_Type* const ftmBase, ftm_clock_ps_t FtmClockPrescaler);

/*!
 * @brief Disables the PWM output mode.
 *
 * @param ftmBase The FTM base address pointer
 * @param config PWM configuration parameter
 * @param channel The channel or channel pair number(combined mode).
 */
void FTM_HAL_DisablePwmMode(FTM_Type* const ftmBase, uint8_t channel);

/*FTM sync configuration*/

/*!
 * @brief Sets the FTM register synchronization method.
 *
 * This function will set the necessary bits for the synchronization mode that user wishes to use.
 *
 * @param ftmBase The FTM base address pointer
 * @param syncMethod  Synchronization method defined by ftm_sync_method_t enum. User can choose
 *                    multiple synch methods by OR'ing options
 */
void FTM_HAL_SetSyncMode(FTM_Type* const ftmBase, uint32_t syncMethod);

/*!
 * @brief Sets the FTM peripheral timer channel input capture filter value.
 * @param ftmBase The FTM base address pointer
 * @param channel  The FTM peripheral channel number, only 0,1,2,3, channel 4, 5,6, 7 don't have.
 * @param val  Filter value to be set
 */
void FTM_HAL_SetChnInputCaptureFilter(FTM_Type* const ftmBase, uint8_t channel, uint8_t value);

bool FTM_HAL_GetDualChnCombine(FTM_Type* const ftmBase, uint8_t chnlPairNum);

#if defined(__cplusplus)
}
#endif

/*! @}*/


#endif /* __FSL_FTM_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/
